app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @all_ratings = Movie.uniq.pluck(:rating)
---
SELECT "movies".* FROM "movies" ORDER BY title
SELECT DISTINCT "movies"."rating" FROM "movies"